app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 8]]
UPDATE "movies" SET "released_on" = ?, "updated_at" = ? WHERE "movies"."id" = 8  [["released_on", "2013-05-09"], ["updated_at", "2015-05-09 09:49:21.109327"]]
---
  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)

INSERT INTO "movies" ("cast", "created_at", "description", "director", "duration", "image_file_name", "rating", "released_on", "title", "total_gross", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
     CreateUser.perform_async
      if @movie.save